Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: the Quarkus Gradle plugin
es_es: el plugin Quarkus Gradle

source: the `amqp-host` or `amqp-port` is configured
es_es: el `amqp-host` o `amqp-port` está configurado

source: the `api-server-url` is configured
es_es: el `master-url` está configurado

source: the `kafka.bootstrap.servers` is configured
es_es: el `kafka.bootstrap.servers` está configurado

source: the `rabbitmq-host` or `rabbitmq-port` is configured
es_es: el `rabbitmq-host` o `rabbitmq-port` está configurado

source: the `upx` command to be available in the system `PATH`;
es_es: el comando `upx` para que esté disponible en el sistema `PATH`;

source: the application configuration file
es_es: el archivo de configuración de la aplicación

source: the channel configuration defines the `cloud-events-type` and `cloud-events-source` attributes.
es_es: la configuración del canal define los atributos `cloud-events-type` y `cloud-events-source`.

source: the corresponding Java type
es_es: el tipo Java correspondiente

source: the deployment extension artifact `quarkus-extension-a-deployment`
es_es: el artefacto de extensión del despliegue `quarkus-extension-a-deployment`

source: the extension provides the `io.quarkus.hibernate.orm` capability (multiple `provides` elements are allowed)
es_es: la extensión proporciona la capacidad de `io.quarkus.hibernate.orm` (se permiten múltiples elementos de `provides` )

source: the extension requires the `io.quarkus.agroal` capability to be provided to function properly (multiple `requires` elements are allowed)
es_es: la extensión requiere que se proporcione la capacidad de `io.quarkus.agroal` para funcionar correctamente (se permiten múltiples elementos de `requires` )

source: the goal that generates the extension descriptor which every Quarkus runtime extension project should be configured with
es_es: el objetivo que genera el descriptor de extensión con el que debe configurarse cada proyecto de extensión en tiempo de ejecución de Quarkus

source: the goal that generates the extension descriptor which every Quarkus runtime extension project should be configured with;
es_es: el objetivo que genera el descriptor de extensión con el que debe configurarse cada proyecto de extensión en tiempo de ejecución de Quarkus;

source: the hosts property is configured, depending on the extension used it can be:
es_es: la propiedad hosts está configurada, dependiendo de la extensión utilizada puede ser:

source: the message metadata contains an `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` instance,
es_es: los metadatos del mensaje contienen una instancia de `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata`,

source: the runtime extension artifact `quarkus-extension-a`
es_es: el artefacto de extensión en tiempo de ejecución `quarkus-extension-a`

source: upx is cross-platform.
es_es: upx es multiplataforma.

source: xref:cli-tooling.adoc[CLI]
es_es: xref:cli-tooling.html[CLI]

source: xref:gradle-tooling.adoc[Gradle]
es_es: xref:gradle-tooling.html[Gradle]

source: xref:grpc-getting-started.adoc[Getting Started]
es_es: xref:grpc-getting-started.html[Cómo empezar]

source: xref:grpc-kubernetes.adoc[Deploying your gRPC Service in Kubernetes]
es_es: xref:grpc-kubernetes.adoc[Consumir un servicio gRPC]

source: xref:grpc-service-consumption.adoc[Consuming a gRPC Service]
es_es: xref:grpc-service-consumption.html[Consumir un servicio gRPC]

source: xref:grpc-service-implementation.adoc[Implementing a gRPC Service]
es_es: xref:grpc-service-implementation.html[Implementación de un servicio gRPC]

source: xref:grpc-xds.adoc[Enabling xDS gRPC support]
es_es: xref:grpc-xds.adoc[Activación del soporte xDS gRPC]

source: xref:ide-tooling.adoc[IDE]
es_es: xref:ide-tooling.html[IDE]

source: xref:maven-tooling.adoc[Maven]
es_es: xref:maven-tooling.html[Maven]

source: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Combining authentication mechanisms]
es_es: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Combinación de mecanismos de autenticación]

source: xref:security-authentication-mechanisms.adoc#form-auth[Form-based authentication]
es_es: xref:security-authentication-mechanisms.adoc#form-auth[Autenticación basada en formularios]

source: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[Choosing between OpenID Connect, SmallRye JWT, and OAuth2 authentication mechanisms]
es_es: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[Elegir entre los mecanismos de autenticación OpenID Connect, SmallRye JWT y OAuth2]

source: xref:security-basic-authentication.adoc[Basic authentication]
es_es: xref:security-basic-authentication.adoc[Autenticación básica]

source: xref:security-identity-providers.adoc[Identity Providers]
es_es: xref:security-identity-providers.adoc[Proveedores de identidad]

source: xref:security-jdbc.adoc[Using security with JDBC]
es_es: xref:security-jdbc.adoc[Uso de la seguridad con JDBC]

source: xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence]
es_es: xref:security-jpa.adoc[Seguridad Quarkus con Jakarta Persistence]

source: xref:security-ldap.adoc[Using security with an LDAP realm]
es_es: xref:security-ldap.adoc[Utilizar la seguridad con un dominio LDAP]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OpenID Connect (OIDC) Bearer token authentication]
es_es: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Proteger una aplicación de servicio mediante la autenticación de portador OpenID Connect (OIDC)]

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication]
es_es: xref:security-oidc-bearer-token-authentication.adoc[Autenticación del portador OIDC]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect and OAuth2 Client and Filters Reference Guide]
es_es: xref:security-openid-connect-client-reference.adoc[Guía de referencia del cliente y los filtros de OpenID Connect y OAuth2]

source: xref:security-overview.adoc[Quarkus Security overview]
es_es: xref:security-overview.adoc [Visión general de Quarkus Security]

source: xref:security-overview.adoc[Quarkus Security]
es_es: xref:security-overview.adoc[Quarkus Seguridad]

source: xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties]
es_es: xref:security-testing.adoc#configuring-user-information[Configuración de la información de usuario en application.properties]

source: xref:spring-boot-properties.adoc[Quarkus - Extension for Spring Boot properties]
es_es: xref:spring-boot-properties.html[Quarkus - Extensión para las propiedades de Spring Boot]

source: xref:spring-cache.adoc[Quarkus - Extension for Spring Cache]
es_es: xref:spring-cache.html[Quarkus - Extensión para Spring Cache]

source: xref:spring-data-jpa.adoc[Quarkus - Extension for Spring Data JPA]
es_es: xref:spring-data-jpa.html[Quarkus - Extensión para Spring Data JPA]

source: xref:spring-data-rest.adoc[Quarkus - Extension for Spring Data REST]
es_es: xref:spring-data-rest.html[Quarkus - Extensión para Spring Data REST]

source: xref:spring-di.adoc[Quarkus - Extension for Spring DI]
es_es: xref:spring-di.html[Quarkus - Extensión para Spring DI]

source: xref:spring-scheduled.adoc[Quarkus - Extension for Spring Scheduled]
es_es: xref:spring-scheduled.html[Quarkus - Extensión para la primavera programada]

source: xref:spring-security.adoc[Quarkus - Extension for Spring Security]
es_es: xref:spring-security.html[Quarkus - Extensión para la seguridad de Spring]

source: xref:spring-web.adoc[Quarkus - Extension for Spring Web]
es_es: xref:spring-web.html[Quarkus - Extensión para Spring Web]

source: you include the `quarkus-test-kubernetes-client` dependency
es_es: incluye la dependencia `quarkus-test-kubernetes-client`

source: your selected filters
es_es: sus filtros seleccionados
